---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplaySketchyLines.Jitter
source: html/74e61398-d5d5-18d5-9481-e3ca301547fd.htm
---
# Autodesk.Revit.DB.ViewDisplaySketchyLines.Jitter Property

The jitter defines jitteriness of the line.
 Values between 0 and 10.

## Syntax (C#)
```csharp
public int Jitter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The jitter value is not valid. The valid range is 0 to 10.